SigninLogs
| where TimeGenerated >= ago(6h)
| where ResultType != 0
| summarize DistinctUsers=dcount(UserPrincipalName), Attempts=count(), ExampleUsers=makeset(UserPrincipalName, 10) by IPAddress
| where DistinctUsers >= 10 and Attempts >= 30
| order by Attempts desc